Humidyne-Labs/esp32-s3_bsp/examples/Unified_BSP_Demo/sdkconfig.defaults.esp32s3
# =========================================================================
# Target Hardware: ESP32-S3-PICO-1-N8R8 (8MB Flash QIO, 8MB PSRAM Octal OPI)
# Target Board: Waveshare ESP32-S3-Touch-ePaper-1.54 V2
# =========================================================================

# Target Architecture & Clocking
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Board Support Package (BSP) Feature Toggles
CONFIG_BSP_ENABLE_TOUCH=y
CONFIG_BSP_SHTC3_LOW_POWER=y
CONFIG_BSP_AUDIO_DEFAULT_VOLUME=80

# Audio Codec (Everest ES8311 - Disable 9 Unused Codec Drivers)
CONFIG_CODEC_ES8311_SUPPORT=y
CONFIG_CODEC_ES7210_SUPPORT=n
CONFIG_CODEC_ES7243_SUPPORT=n
CONFIG_CODEC_ES7243E_SUPPORT=n
CONFIG_CODEC_ES8156_SUPPORT=n
CONFIG_CODEC_AW88298_SUPPORT=n
CONFIG_CODEC_ES8389_SUPPORT=n
CONFIG_CODEC_ES8374_SUPPORT=n
CONFIG_CODEC_ES8388_SUPPORT=n
CONFIG_CODEC_TAS5805M_SUPPORT=n

# =========================================================================
# LVGL v9 Graphics Engine (Debloated 1-Bit Monochrome SSD1681 Optimization)
# =========================================================================
CONFIG_LV_COLOR_DEPTH_1=y
CONFIG_LV_COLOR_DEPTH=1
CONFIG_LV_DRAW_SW_SUPPORT_I1=y
CONFIG_LV_DPI_DEF=188
CONFIG_LV_MEM_CUSTOM=y

# Fonts: Keep Only Montserrat 14, Disable Unused Bitmap & Fixed Fonts
CONFIG_LV_FONT_MONTSERRAT_8=n
CONFIG_LV_FONT_MONTSERRAT_10=n
CONFIG_LV_FONT_MONTSERRAT_12=n
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=n
CONFIG_LV_FONT_MONTSERRAT_18=n
CONFIG_LV_FONT_MONTSERRAT_20=n
CONFIG_LV_FONT_MONTSERRAT_22=n
CONFIG_LV_FONT_MONTSERRAT_24=n
CONFIG_LV_FONT_MONTSERRAT_26=n
CONFIG_LV_FONT_MONTSERRAT_28=n
CONFIG_LV_FONT_MONTSERRAT_30=n
CONFIG_LV_FONT_MONTSERRAT_32=n
CONFIG_LV_FONT_MONTSERRAT_34=n
CONFIG_LV_FONT_MONTSERRAT_36=n
CONFIG_LV_FONT_MONTSERRAT_38=n
CONFIG_LV_FONT_MONTSERRAT_40=n
CONFIG_LV_FONT_MONTSERRAT_42=n
CONFIG_LV_FONT_MONTSERRAT_44=n
CONFIG_LV_FONT_MONTSERRAT_46=n
CONFIG_LV_FONT_MONTSERRAT_48=n
CONFIG_LV_FONT_UNSCII_8=n
CONFIG_LV_FONT_UNSCII_16=n
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# Build: Disable LVGL Examples and Demos
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_LV_USE_DEMO_WIDGETS=n
CONFIG_LV_USE_DEMO_KEYPAD_AND_ENCODER=n
CONFIG_LV_USE_DEMO_BENCHMARK=n
CONFIG_LV_USE_DEMO_RENDER=n
CONFIG_LV_USE_DEMO_STRESS=n
CONFIG_LV_USE_DEMO_MUSIC=n
CONFIG_LV_USE_DEMO_FLEX_LAYOUT=n
CONFIG_LV_USE_DEMO_MULTILANG=n
CONFIG_LV_USE_DEMO_TRANSFORM=n
CONFIG_LV_USE_DEMO_SCROLL=n
CONFIG_LV_USE_DEMO_VECTOR_GRAPHIC=n

# Themes: Enable Mono / Simple, Disable Heavy Default Theme
CONFIG_LV_USE_THEME_DEFAULT=n
CONFIG_LV_USE_THEME_MONO=y
CONFIG_LV_USE_THEME_SIMPLE=y

# Layouts: Keep Flex, Disable Grid & Observers
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=n
CONFIG_LV_USE_OBSERVER=n

# Required Core Widgets for ePaper UI
CONFIG_LV_USE_OBJ=y
CONFIG_LV_USE_BUTTON=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_LINE=y
CONFIG_LV_USE_IMAGE=y

# Debloat: Disable Unused LVGL Widgets
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_ARC=n
CONFIG_LV_USE_ARCLABEL=n
CONFIG_LV_USE_BAR=n
CONFIG_LV_USE_BUTTONMATRIX=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CANVAS=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_CHECKBOX=n
CONFIG_LV_USE_DROPDOWN=n
CONFIG_LV_USE_IMAGEBUTTON=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_ROLLER=n
CONFIG_LV_USE_SCALE=n
CONFIG_LV_USE_SLIDER=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_SPINNER=n
CONFIG_LV_USE_SWITCH=n
CONFIG_LV_USE_TEXTAREA=n
CONFIG_LV_USE_TABLE=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n

# Debloat: Disable Third-Party Decoders & Vector Engines
CONFIG_LV_USE_FREETYPE=n
CONFIG_LV_USE_TINY_TTF=n
CONFIG_LV_USE_FFMPEG=n
CONFIG_LV_USE_LODEPNG=n
CONFIG_LV_USE_LIBPNG=n
CONFIG_LV_USE_BMP=n
CONFIG_LV_USE_TJPGD=n
CONFIG_LV_USE_LIBJPEG_TURBO=n
CONFIG_LV_USE_GIF=n
CONFIG_LV_USE_QRCODE=n
CONFIG_LV_USE_BARCODE=n
CONFIG_LV_USE_VECTOR_GRAPHIC=n
CONFIG_LV_USE_SNAPSHOT=n
CONFIG_LV_USE_MONKEY=n
CONFIG_LV_USE_PROFILER=n
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n

# Supported Color Formats
CONFIG_LV_DRAW_SW_SUPPORT_RGB565=n
CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED=n
CONFIG_LV_DRAW_SW_SUPPORT_RGB565A8=n
CONFIG_LV_DRAW_SW_SUPPORT_RGB888=n
CONFIG_LV_DRAW_SW_SUPPORT_XRGB8888=n
CONFIG_LV_DRAW_SW_SUPPORT_ARGB8888=n
CONFIG_LV_DRAW_SW_SUPPORT_ARGB8888_PREMULTIPLIED=n
CONFIG_LV_DRAW_SW_SUPPORT_L8=n
CONFIG_LV_DRAW_SW_SUPPORT_AL88=n
CONFIG_LV_DRAW_SW_SUPPORT_A8=n

# SPI Flash Configuration (8MB Quad SPI @ 80MHz)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM Configuration (8MB Octal SPI @ 80MHz)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Custom Dual-Slot OTA Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# FreeRTOS System Timing
CONFIG_FREERTOS_HZ=1000

# Bluetooth & NimBLE Provisioning (GATT Scheme for Web Dashboard)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_WIFI_PROV_SCHEME_BLE=y
CONFIG_WIFI_PROV_AUTOSTOP_TIMEOUT=60
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_0=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_2=y

# TLS, Security & Certificate Bundle (for ThingsBoard MQTTS & OTA)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_ESP_HTTPS_OTA_DECRYPT_CB=n
